[
    {
       "topic":"Can convalescent plasma cure COVID-19?",
       "snippets":[
          {
             "snippet_id":"c2e0da8e-0306-4a4b-b593-84c8a45395db",
             "snippet_title":"Plasma therapy no treatment for Covid-19: Health Ministry | IndiLeak — Latest India Breaking News, Real Hard News, Scam News, Politics, Entertainment News",
             "snippet_url":"https://indileak.com/2020/04/plasma-therapy-no-treatment-for-covid-19-health-ministry/ ",
             "snippet_description":"In fact, there is no approved therapy for Covid-19 anywhere in the world. ”Till the ICMR concluded its study of the plasma therapy for Covid-19, it would be unethical and illegal to call it a treatment for the coronavirus infection, he said."
          },
          {
             "snippet_id":"cabe8e93-81be-4d48-8333-266f731af782",
             "snippet_title":"Currently Just an Experiment': Centre Says no Evidence Plasma Therapy Can Cure COVID-19 ",
             "snippet_url":" https://www.india.com/news/india/currently-just-an-experiment-centre-says-no-evidence-to-show-plasma-therapy-can-cure-covid-19-4013692/ ",
             "snippet_description":"Earlier this month, Kerala became the first state to use it for treatment of COVID-19 patients, after receiving permission from the ICMR in this regard. Later, Delhi, too started administering plasma therapy to coronavirus patients; this gave ‘encouraging’ results."
          },
          {
             "snippet_id":"0ea1f2e6-b532-44c0-821f-70a6ef6735eb",
             "snippet_title":"Search for COVID-19 cure: Coronavirus’ possible weak spot found | World – Gulf News ",
             "snippet_url":"https://gulfnews.com/world/covid-19-whats-new-on-coronavirus-treatments-1.1586260786481 ",
             "snippet_description":"The technique of convalescent plasma, first used in the 1890s against diphtheria, seems to work against COVID-19 too. A pilot study conducted at three hospitals in China suggested the benefits of harvesting antibodies from recovered people and administering it to people battling COVID-19. "
          },
          {
             "snippet_id":"cb5946b7-39a9-4d03-aa3a-9930a4c3d77e",
             "snippet_title":"Expert appreciate Health Min's remark that there is no proof about efficacy of plasma therapy | Deccan Herald",
             "snippet_url":" https://www.deccanherald.com/national/expert-appreciate-health-mins-remark-that-there-is-no-proof-about-efficacy-of-plasma-therapy-831181.html ",
             "snippet_description":"Neeraj Nischal, associate professor in the Department of Medicine at AIIMS, said that in the absence of any specific antiviral medications for the treatment of COVID-19, convalescent plasma ( plasma from patients who have recovered from the illness) is being seen as a promising therapeutic option. But for plasma therapy to be effective, plasma must contain sufficient amount of neutralizing antibody against that infection."
          },
          {
             "snippet_id":"daee3dea-9939-4a41-a54c-8c48fd25f4b8",
             "snippet_title":"AIMIM chief shares details of 32 coronavirus cured patients willing to donate plasma | Hindustan Times",
             "snippet_url":" https://www.hindustantimes.com/andhra-pradesh/aimim-chief-shares-details-of-32-coronavirus-cured-patients-willing-to-donate-plasma/story-vZcAtddgiteNVT0plWJuFK.html ",
             "snippet_description":"Cautioning about the risks of using plasma therapy, ICMR further tweeted: “#COVID19 convalescent plasma therapy comes with its own share of technical challenges, like antibody titer testing. There are also several risks of using this therapy including life-threatening allergic reactions and lung injury."
          },
          {
             "snippet_id":"60781b1a-0a9c-4802-9e0f-eea97e20db36",
             "snippet_title":"COVID-19: Plasma Therapy likely to begin from April 25 in Karnataka | Deccan Herald ",
             "snippet_url":" https://www.deccanherald.com/state/top-karnataka-stories/covid-19-plasma-therapy-likely-to-begin-from-april-25-in-karnataka-829398.html ",
             "snippet_description":"Speaking to reporters here, he said the convalescent Plasma Therapy was only for patients who are critical, in Intensive Care Units or on ventilator. According to the latest update, five COVID-19 patients are in ICUs in the state."
          },
          {
             "snippet_id":"b9cbbf6a-43d8-4be3-aa6c-da60d1161ba8",
             "snippet_title":"What is Plasma Therapy? How is it going to help lead India's fightback against COVID-19?",
             "snippet_url":" https://www.freepressjournal.in/india/what-is-plasma-therapy-how-is-it-going-to-help-lead-indias-fightback-against-covid-19 ",
             "snippet_description":"Plasma from a patient who has recovered from COVID-19 is transfused into a COVID-19 patient. The point behind this experiment is that a healthy person's immunity can be transferred to a person via convalescent plasma who is suffering from the virus due to low immunity."
          },
          {
             "snippet_id":"670f17e8-1fa3-4a8b-9dc7-272e07e833ee",
             "snippet_title":"New coronavirus treatment helps the infected get better WITHIN DAYS - St. Lucia News Online",
             "snippet_url":" https://www.stlucianewsonline.com/new-coronavirus-treatment-helps-the-infected-get-better-within-days/",
             "snippet_description":"The authors wrote: ‘This pilot study on [convalescent plasma] therapy shows a potential therapeutic effect and low risk in the treatment of severe COVID-19 patients. ‘One dose of [convalescent plasma] with a high concentration of neutralizing antibodies can rapidly reduce the viral load and tends to improve clinical outcomes."
          }
       ]
    },
    {
       "topic":"Can exposure to UV light prevent COVID-19?",
       "snippets":[
          {
             "snippet_id":"06595b02-6a27-481e-adc3-f4f49a7fc124",
             "snippet_title":"Here´s What Disinfectants and UV Light Really Do to Your Body",
             "snippet_url":"https://www.wired.com/story/heres-what-disinfectants-and-uv-light-really-do-to-your-body/ ",
             "snippet_description":"Any remaining viruses would simply multiply, leaving the person still trying to fight off a Covid-19 infection—but now with potential cellular damage from the UV light. Brenner has been studying far-UVC, a wavelength that can kill viruses but can’t penetrate beyond the top layer of human skin, which is made up of dead cells."
          },
          {
             "snippet_id":"6cf338bc-8613-4077-8878-f95ff6d1c9eb",
             "snippet_title":"Ultraviolet light can be used against coronavirus — just not in the way Trump imagines ",
             "snippet_url":" https://news.yahoo.com/ultraviolet-light-can-be-used-against-coronavirus-just-not-in-the-way-trump-imagines-090000567.html ",
             "snippet_description":"President Trump’s mention Thursday of treating COVID-19 with ultraviolet light was part of a rambling digression that included speculation about administering disinfectants to patients, prompting confusion and alarm from medical experts. The president’s invocation of pseudoscience — which he claimed on Friday had been a joke intended “sarcastically” to provoke reporters — overshadowed the news from the briefing about evidence, first reported last week by Yahoo News, that ultraviolet light does destroy the coronavirus."
          },
          {
             "snippet_id":"11755246-3c48-4ba3-afa4-d26e038c2a55",
             "snippet_title":"No, don’t inject disinfectant: Outcry over Trump’s musing ",
             "snippet_url":" https://www.walb.com/2020/04/24/bright-light-disinfectant-body-not-recommended-tactics-fight-coronavirus-expert-says/ ",
             "snippet_description":"But it sounds interesting to me,” he added. Doctors warn high-intensity UV lamps and sun exposure will not protect you from the coronavirus."
          },
          {
             "snippet_id":"b3c912ec-f594-4fb8-92f0-555a0cf521cc",
             "snippet_title":">‘Far UVC’- To The Rescue | Udaipur News | Udaipur Latest News | udaipur local news । Udaipur Updates",
             "snippet_url":"https://udaipurkiran.com/far-uvc-to-the-rescue/",
             "snippet_description":"This article tries to explore how this lethality of the UVC can be redirected to our fight against SARS COV2 aka the novel Corona Virus which causes COVID19. Ultraviolet light kills microbes by a completely different mechanism from the way the drugs kill them, so ultraviolet light is just as capable of killing a drug-resistant microbe as any other microbe. "
          },
          {
             "snippet_id":"18526cf6-d581-4339-880c-a277cdb3fb1e",
             "snippet_title":"31 Best UV Sterilizers to Safely Kill Germs (2021) | Heavy.com",
             "snippet_url":"https://heavy.com/health/2020/03/uv-sterilizer/",
             "snippet_description":"99 percent of harmful germs including salmonella, E. Coli and viruses like MRSA, Staph, COVID-19, the PurLite sanitizer device is a must-have in your home, especially right now. This UV sterilizer works at lightning-fast speed."
          },
          {
             "snippet_id":"5ecba7b7-008a-4a6d-b377-55d6051656e9",
             "snippet_title":"Fact check: Sunlight does not kill the new coronavirus",
             "snippet_url":" https://oklahoman.com/article/5658988/fact-check-sunlight-does-not-kill-the-new-coronavirus?",
             "snippet_description":"Ultraviolet is able to kill COVID-19 if it is exposed to the concentrated UV ray in a certain amount of time and distance,” she said to AFP Fact Check. “However, that level of UV exposure is harmful to human’s skin."
          },
          {
             "snippet_id":"4ff03983-427e-4f09-b00f-b35619ca7aab",
             "snippet_title":"7 Things The Coronavirus Fears? Thai Paper Publishes Misleading Report",
             "snippet_url":" https://www.boomlive.in/world/coronavirus/7-things-the-coronavirus-fears-thai-paper-publishes-misleading-report-7318 ",
             "snippet_description":"Ultraviolet is able to kill COVID-19 if it is exposed to the concentrated UV ray in a certain amount of time and distance,\" Dr. Pokrath Hansasuta, an assistant professor of virology in Chulalongkorn University's Department of Microbiology, explained to AFP by phone on March 18, 2020. \"However, that level of UV exposure is harmful to human's skin. "
          },
          {
             "snippet_id":"192eca32-d5c4-4933-9b6d-8434f9ebf48c",
             "snippet_title":"If sunlight kills coronavirus, why not try UV lamps? - Local News 8",
             "snippet_url":" https://localnews8.com/health/2020/04/26/if-sunlight-kills-coronavirus-why-not-try-uv-lamps/",
             "snippet_description":"UV lamps should not be used to sterilize hands or other areas of skin as UV radiation can cause skin irritation,” WHO says. “You can catch COVID-19, no matter how sunny or hot the weather is. "
          }
       ]
    },
    {
       "topic":"Can high temperatures and humidity prevent COVID-19?",
       "snippets":[
          {
             "snippet_id":"ea4435da-9f61-469d-a11a-33fcb9653054",
             "snippet_title":"Scientists warn that Trump is wrong: Warm weather won’t kill coronavirus – BGR",
             "snippet_url":" https://bgr.com/2020/04/09/coronavirus-usa-warmer-weather-wont-reduce-covid-19-transmission/",
             "snippet_description":"President Trump said in the past that warmer weather will make the virus disappear “miraculously,” starting in April. COVID-19 caseloads in countries with warmer climates, as well as coronavirus cases from warm US states like California and Florida, prove the virus can be very infectious regardless of the weather."
          },
          {
             "snippet_id":"fe95c08a-a416-44e9-b564-612daff46542",
             "snippet_title":"Good News: Chinese Scientists have Proven that Warmer Weather and High Relative Humidity Significantly Reduce Spread of COVID-19 - Novinite.com - Sofia News Agency",
             "snippet_url":" https://www.novinite.com/articles/203721/Good+News%3A+Chinese+Scientists+have+Proven+that+Warmer+Weather+and+High+Relative+Humidity+Significantly+Reduce+Spread+of+COVID-19 ",
             "snippet_description":"“High temperature and high relative humidity significantly reduce the transmission of COVID-19. ” An increase of just one degree Celsius and 1% relative humidity increase substantially lower the virus’s transmission, according to the data analyzed by the researchers."
          },
          {
             "snippet_id":"26f92135-ee3e-48dd-a6d6-4c9956f781ca",
             "snippet_title":"Increased indoor humidity may decrease #Coronavirus #COVID-19 transmission – Watts Up With That?",
             "snippet_url":" https://wattsupwiththat.com/2020/03/28/increased-indoor-humidity-may-decrease-coronavirus-covid-19-transmission/ ",
             "snippet_description":"There is no data to suggest that adjusting the temperature or humidity of a building would be an effective way to reduce transmission of COVID-19. The Health Department does not recommend that buildings increase humidity levels to control COVID-19 transmission."
          },
          {
             "snippet_id":"d79927e3-a709-47d6-a2b9-826d6fe3762d",
             "snippet_title":"Myth Busters: 19 Wrong Beliefs About The Novel Coronavirus – Channels Television",
             "snippet_url":" https://www.channelstv.com/2020/04/30/myth-busters-19-wrong-beliefs-about-the-novel-coronavirus/",
             "snippet_description":"Exposing yourself to the sun or to temperatures higher than 25C degrees DOES NOT prevent the coronavirus disease ( COVID-19) You can catch COVID-19, no matter how sunny or hot the weather is. Countries with hot weather have reported cases of COVID-19."
          },
          {
             "snippet_id":"fb6a1e79-37cf-4cbd-ad3f-48fa25dcf9ab",
             "snippet_title":"Coronavirus MORE POWERFUL than first thought after terrifying super-spreader revelation | World | News | Express.co.uk",
             "snippet_url":" https://www.express.co.uk/news/world/1262785/coronavirus-chinese-scientists-covid-19-high-temperatures?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+daily-express-world-news+%28Express+%3A%3A+World+Feed%29 ",
             "snippet_description":"The Nanjing scientists published a research letter explaining their findings and warning that, contrary to earlier studies, COVID-19 was not likely to slowdown when temperatures rise. Trending They said: \"Previous studies have demonstrated that the transmission rate of a virus is significantly weakened in an environment with high temperature and humidity."
          },
          {
             "snippet_id":"2b771286-15ce-48e9-875d-a43907557f24",
             "snippet_title":"Explained: Why it might be a good idea to keep AC temperature above 24 degrees this summer | Explained News,The Indian Express",
             "snippet_url":" https://indianexpress.com/article/explained/coronavirus-air-conditioner-temperature-guidelines-humidity-6378739/ ",
             "snippet_description":"In humid climates set temperature closer to 24 degrees Celsius for de humidification and in dry climates closer to or at 30 degrees Celsius and use fans to increase air movement) . ” It quotes a study that found the transmission of Covid-19 in 100 cities in China lower in high temperature and high humidity."
          },
          {
             "snippet_id":"e31bfeb5-768f-417e-b881-4cf6d44c6d03",
             "snippet_title":"Covid-19: government guidelines on air conditioning, refrigerators and fans — TruthDive ",
             "snippet_url":" https://truthdive.com/2020/04/25/covid-19-government-guidelines-on-air-conditioning-refrigerators-and-fans/ ",
             "snippet_description":"The study of Covid-19 virus transmission in 100 cities in China indicates that high temperature and high humidity significantly reduce influenza transmission. Low temperatures ( 7–8 ° C) have been found to be optimal for influenza survival in the air."
          },
          {
             "snippet_id":"f4ffaa81-0d24-42eb-ab94-23143f4b24d1",
             "snippet_title":"Coronavirus mythbusters: Falsehoods about the disease also are going viral",
             "snippet_url":" https://www.clickorlando.com/news/2020/04/01/coronavirus-mythbusters-falsehoods-about-the-disease-also-are-going-viral/ ",
             "snippet_description":"The researchers found that, \"high temperature and high relative humidity significantly reduce the transmission of COVID-19, respectively, even after controlling for population density and GDP per capita of cities,\" the researchers wrote in the paper, published in SSRN, formerly the Social Science Research Network, an international journal. The closely related SARS-CoV-1 virus that spread in 2003 was contained so quickly that not much data exists about how seasons affected it."
          }
       ]
    },
    {
       "topic":"Can ACE and ARBs worsen COVID-19?",
       "snippets":[
          {
             "snippet_id":"019cb0b8-c38c-40e5-ac87-4ebafc8cdae4",
             "snippet_title":"Statement Addresses Concerns About Heart Meds and COVID-19 | Physician's Weekly",
             "snippet_url":" https://www.physiciansweekly.com/statement-addresses-concerns-about-heart-meds-and-covid-19/",
             "snippet_description":"Based on this hypothesis, the authors suggest that patients with cardiac diseases, hypertension, or diabetes, treated with ACE2-increasing drugs, may be at higher risk for severe COVID-19 infection and should be monitored for ACE2-modulating medications. “There are no experimental or clinical data demonstrating beneficial or adverse outcomes among COVID-19 patients using ACE inhibitor or ARB medications,” Richard J. Kovacs, M. D. , president of the ACC, said in a statement."
          },
          {
             "snippet_id":"00f9666f-622f-4aca-9861-6cab59a5fd8b",
             "snippet_title":"Inaccurate info on social media, don't stop your pills: Scientists | CanIndia News ",
             "snippet_url":"https://www.canindia.com/inaccurate-info-on-social-media-dont-stop-your-pills-scientists/ ",
             "snippet_description":"While there is no credible evidence that ARBs increase COVID-19 risk, the researchers noted that there are clear dangers for patients who stop taking their medications. Widespread discontinuation of ARBs and ACE inhibitors could cause destabilisation of blood pressure control and decompensation of heart failure patients, leading to sharp increases in heart attacks and strokes and a worsening of kidney failure."
          },
          {
             "snippet_id":"041ef27a-3b9e-46a8-8cc3-cffe5393dd18",
             "snippet_title":"Heart and Kidney Patients Should Continue Thier Meds: COVID-19 Alert",
             "snippet_url":" https://www.medindia.net/news/heart-and-kidney-patients-should-continue-their-meds-covid-19-alert-194016-1.htm ",
             "snippet_description":"However, the evidence that ARBs may increase COVID-19 risk is inconsistent, at best. Though some studies have shown ARBs increase ACE 2 activity in animal models, it must be emphasized that the results have been inconsistent."
          },
          {
             "snippet_id":"0ec0fc93-20d0-4bdc-9d36-a1ac105f6936",
             "snippet_title":"What does COVID-19 mean for kidneys? - The Hindu",
             "snippet_url":" https://www.thehindu.com/news/cities/chennai/what-does-covid-19-mean-for-kidneys/article31094365.ece/amp/ ",
             "snippet_description":"The reason for this was the direct involvement of the kidneys with the virus and also the inflammatory toxins ( cytokines) released in sick patients. One interesting finding was that among the patients who were taking certain BP drugs like ARB and ACE inhibitors, the death rate was higher."
          },
          {
             "snippet_id":"7e6f927a-2c8c-49c2-af66-d9826d90a660",
             "snippet_title":"Coronavirus: Blood pressure medication 'could worsen symptoms' | Daily Mail Online ",
             "snippet_url":" https://www.dailymail.co.uk/news/article-8108735/Medicines-high-blood-pressure-diabetes-worsen-coronavirus-symptoms.html? ",
             "snippet_description":"Researchers led by Dr Michael Roth, from the University of Basel, wrote: 'These data suggest that ACE2 expression is increased in diabetes and treatment withACE inhibitors and ARBs increases ACE2 expression. 'Consequently, the increased expression of ACE2 would facilitate infection with COVID-19."
          },
          {
             "snippet_id":"39e4f6e6-be4d-4967-9420-98a42186a1e7",
             "snippet_title":"Israel National News - Ibuprofen exacerbates coronavirus disease",
             "snippet_url":"https://www.israelnationalnews.com/News/News.aspx/277457",
             "snippet_description":"Suggest that ACE2 expression is increased in diabetes and treatment with ACE inhibitors and ARBs increases ACE2 expression. Consequently, the increased expression of ACE2 would facilitate infection with COVID-19."
          },
          {
             "snippet_id":"04e05b6b-30e8-483d-9154-da720b88d8d1",
             "snippet_title":"Doctor offers coronavirus protection advice",
             "snippet_url":"https://www.fox10phoenix.com/news/doctor-offers-coronavirus-protection-advice",
             "snippet_description":"A recent study from China demonstrated through indirect measures that ACE-2 function declines with severity of COVID-19 pneumonia. For people already taking blood pressure medication, the inclusion of an ARB may improve the response to COVID-19 infection."
          },
          {
             "snippet_id":"4691085c-10fb-42f6-ab61-56fb7ad278e8",
             "snippet_title":"Handling the economic damage",
             "snippet_url":" http://johnredwoodsdiary.com/2020/03/24/handling-the-economic-damage/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+JohnRedwoodsDiary+%28John+Redwood%27s+Diary%29 ",
             "snippet_description":"These data suggest that ACE2 expression is increased in diabetes and treatment with ACE inhibitors and ARBs increases ACE2 expression. Consequently, the increased expression of ACE2 would facilitate infection with COVID-19."
          }
       ]
    },
    {
       "topic":"Can Homemade Vodka Sanitizer prevent COVID-19?",
       "snippets":[
          {
             "snippet_id":"0e83c71c-aa23-46b5-9835-c9d19055e320",
             "snippet_title":"Coronavirus tips: How to make homemade hand sanitizer, face masks",
             "snippet_url":" https://eu.elpasotimes.com/story/life/2020/03/23/coronavirus-how-make-hand-sanitizer-face-masks-cdc-covid-19/2885707001/ ",
             "snippet_description":"Protect yourself from coronavirus with DIY hand sanitizer, face masksMason Callejas. First of all, it should be stressed that washing your hands and practicing social distancing are some of the best ways the CDC recommends to limit the spread of the COVID-19 coronavirus, but additional lines of defense are also nice to have. Hand sanitizer and face masks are two simple ways to help prevent the spread of the virus, but the items have become two of the hottest commodities since the outbreak began. "
          },
          {
            "snippet_id":"00626f03-9413-4d60-a177-8536b4b81ac1",
             "snippet_title":"Officials say to 'educate but keep calm' as coronavirus reaches northwest Harris County ",
             "snippet_url":" https://www.chron.com/neighborhood/tomball/news/article/Officials-say-to-educate-but-keep-calm-as-15111703.php ",
             "snippet_description":"Officials say to ‘educate but keep calm’ as coronavirus reaches northwest Harris County By Melanie Feuk, Staff writer Published 3:10 pm CST, Friday, March 6, 2020 ( FILES) In this file photo taken on March 05, 2020 a person takes from a bottle of hydroalcoholic hand sanitizer in Paris amid a spread of COVID-19, the novel coronavius. - US vodka distiller Tito's has warned buyers that making hand sanitizer out of its liquor will not help them fight off the coronavirus, in response to a surge of internet users boasting of making their own moonshine virus protection."
          },
          {
              "snippet_id": "fb46d636-944c-4501-be54-4e43745f32a2",
             "snippet_title":"Don’t use vodka to sanitise hands – it probably won’t protect you from coronavirus and could damage your skin – The Scottish Sun",
             "snippet_url":" https://www.thescottishsun.co.uk/news/5357400/dont-use-vodka-to-sanitise-hands-it-probably-wont-protect-you-from-coronavirus-and-could-damage-your-skin/ ",
             "snippet_description":"However, experts have warned against making your own DIY hand sanitisers. That's because the actual percentage of alcohol might not be enough to kill off viruses, including Covid-19. "
          },
          {
              "snippet_id": "a1b82a39-fa13-4168-bcd3-518cff9d6f94",
             "snippet_title":"Can't find Purell or other hand sanitizers? Here's how to make it at home with vodka or rubbing alcohol",
             "snippet_url":" http://oklahoman.com/article/5656591/cant-find-purell-or-other-hand-sanitizers-heres-how-to-make-it-at-home-with-vodka-or-rubbing-alcohol?custom_click=rss&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Newsok%2FNews+%28NewsOK.com+RSS+-+news%29 ",
             "snippet_description":"Here's how to make it at home with vodka or rubbing alcohol. If you're not prepared to fork over big bucks for a small bottle of hand sanitizer, there's another option beyond good old-fashioned handwashing with soap and water. Along with face masks and sanitizing wipes, alcohol-based sanitizing gel has been one of the most in-demand items as coronavirus fears have sparked panic buying that has left store shelves bare."
          },
          {
              "snippet_id": "61b2a4a9-046f-440d-ad50-e7d5768e5338",
             "snippet_title":"Tito's Vodka Urges Drinkers Not to Use Its Booze as Hand Sanitizer (But You Should Definitely Stockpile It for Your Quarantine)",
             "snippet_url":" https://www.mandatory.com/fun/1544248-titos-vodka-urges-drinkers-not-to-use-its-booze-as-hand-sanitizer-coronavirus?utm_source=rss&utm_medium=rss&utm_campaign=titos-vodka-urges-drinkers-not-to-use-its-booze-as-hand-sanitizer-coronavirus ",
             "snippet_description":"alcoholalcohol contentboozeCDCContagioncoronaviruscoronavirus preventionCOVID-19diseaseDIY hand sanitizerdrinkingepidemicHand Sanitizerhomemade hand sanitizerhow to make your own hand sanitizerillnessisolationnewsOutbreakpandemicquarantinesocial-mediaSpiritstitos vodkaTwittervideoVideosvodkaweird newsMandatoryContact UsAdvertiser InfoPrivacy PolicyTerms & ConditionsAdChoicesMANDATORY. COM IS A PROPERTY OF EVOLVE MEDIA LLC COMPANY."
          },
          {
              "snippet_id": "012f6998-5906-4d3c-b3d6-1bdefe8e7fe9",
             "snippet_title":"Coronavirus: Don't use vodka to sanitise hands - BBC News",
             "snippet_url":"https://www.bbc.com/news/business-51763775",
             "snippet_description":"A rush on hand sanitiser to protect against the coronavirus has seen homemade versions spring up, including one based on a handmade vodka. But vodka maker Tito's quickly shot down a tweet suggesting the use of its spirits is strong enough for that purpose. "
          },
          {
              "snippet_id": "01ab12d1-27c9-43f5-9445-8c151995ba6b",
             "snippet_title":"Distillery: No, you can’t make homemade hand sanitizer using vodka",
             "snippet_url":" https://www.wtvm.com/2020/03/06/distillery-no-you-cant-make-homemade-hand-sanitizer-using-vodka/",
             "snippet_description":"Dermatology: Expert Connect Contact Us Contests Jobs Deals Coronavirus Distillery: No, you can’t make homemade hand sanitizer using vodka. A popular vodka manufacturer is encouraging people not to buy its product to combat the novel coronavirus. Tito's Vodka spent the day Thursday responding to people on Twitter who were saying they wanted to use Tito's to make hand sanitizer. "
          },
          {
              "snippet_id": "5ab9c311-e644-4f2c-9b88-cf57bd227b93",
             "snippet_title":"People are buying Everclear vodka to make homemade sanitizer. | 101.1 The Wiz",
             "snippet_url":" https://wiznation.com/2677832/people-are-buying-everclear-vodka-to-make-homemade-sanitizer/",
             "snippet_description":"Getty With concerts and festivals around the country being cancelled or rescheduled because of fear of the Coronavirus spreading, some Americans are taking matters into their own hands. According to sources people are making homemade sanitizer and Everclear vodka is one of the main ingredients."
          }
       ]
    },
    {
       "topic":"Can Echinacea prevent COVID-19?",
       "snippets":[
          {
             "snippet_id":"00a10a00-761f-4940-bf86-fa04b38f8948",
             "snippet_title":"Will The Listed Sanitiser Stocks Clean Up - Or Clean Out - Investors? – ShareCafe",
             "snippet_url":" https://www.sharecafe.com.au/2020/04/23/will-the-listed-sanitiser-stocks-clean-up-or-clean-out-investors/ ",
             "snippet_description":"The compact is with Holista Colltech ( ( HCT) ) , which will provide the plant-based active ingredient called Path-Away Invisi Shield’s other COVID-19 busting ingredients include olive leaf, echinacea, manuka honey, Kakadu plum, papaya and thyme. Invisi Shield’s plant based formulation does not require TGA approval, while Path-Away is 99."
          },
          {
             "snippet_id":"053ccf3a-ebd6-485b-b2e4-01a0949c3a45",
             "snippet_title":"How to supercharge your immunity in just 7 days: Garlic, zinc, vitamin C and D",
             "snippet_url":" https://www.bodyandsoul.com.au/nutrition/nutrition-tips/build-your-immunity-in-seven-days/news-story/0c4d8903d3f709fbfbf0ccb0568b8a64?nk=96582b73f45a754753cfd0cf901c6653-1584421294 ",
             "snippet_description":"She is also the founder of Bodhi tea. TRENDING ON BODY+SOULhealth Australian deaths from coronavirus COVID-19 could reach 150,. ."
          },
          {
             "snippet_id":"03209ccd-0a82-4822-af66-5894431ca33b",
             "snippet_title":"Coronavirus: How to Boost Your Immune System? | Heavy.com",
             "snippet_url":"https://heavy.com/news/2020/03/coronavirus-immune-system/",
             "snippet_description":"com VIP Maintaining a healthy immune system helps fend off viruses, and may aid in preventing someone from contracting the COVID-19 coronavirus."
          },
          {
             "snippet_id":"05f9ac69-e175-4b20-bd7f-b240c442660e",
             "snippet_title":"5 Antiviral Plants to Boost Your Immune System",
             "snippet_url":"https://us.hola.com/lifestyle/20200324flmrftsaip/antiviral-plants-immune-system-diet ",
             "snippet_description":"That said, remember that none of these plants will cure any specific illness. If you suspect you may be sick or have been exposed to COVID-19, follow the protocol recommended by the who and contact your doctor as soon as possible."
          },
          {
             "snippet_id":"0bd1427d-aafd-41bc-9c1f-02c8268de860",
             "snippet_title":"Boost your Immune System with 5 of Nature’s Best Medicines – The Yucatan Times",
             "snippet_url":" https://www.theyucatantimes.com/2020/04/boost-your-immune-system-with-5-of-natures-best-medicines/",
             "snippet_description":"Echinacea is known to boost production of the protein interferon ( which helps to kill viruses) and of infection-fighting white blood cells. It contains alkylamides, thought to prevent bacteria penetrating the skin."
          },
          {
             "snippet_id":"d73eb8d0-3d49-4753-b6ee-bec406df1d7c",
             "snippet_title":"Immune System Boosters To Prevent Getting The Coronavirus | 97.9 The Beat",
             "snippet_url":" https://thebeatdfw.com/playlist/immune-system-boosters-to-prevent-getting-the-coronavirus/",
             "snippet_description":"The list has an array of natural remedies to keep you up and active. This list isn’t just to use for fighting the COVID-19, you should consider implementing some of these products in your day to day permanently!"
          },
          {
             "snippet_id":"c9ac63a5-802e-47b7-aaee-b28f166d56c5",
             "snippet_title":"Coronavirus: Dietary Supplements Could Disrupt Immune Defences - chb44.com - Life in France",
             "snippet_url":"https://chb44.com/2020/04/coronavirus-dietary-supplements-disrupt-immune-defences/",
             "snippet_description":"It is a fairly powerful natural anti-inflammatory. And we have already received contraindications for anti-inflammatory drugs against Coronavirus Covid-19."
          },
          {
             "snippet_id":"1f52b3fe-b53c-48c0-8dd2-a0427bb1609f",
             "snippet_title":"Be careful, says Health Canada. Donald Trump isn’t the only one promoting COVID-19 ‘cures’",
             "snippet_url":" https://www.flamboroughreview.com/news-story/9963803-be-careful-says-health-canada-donald-trump-isn-t-the-only-one-promoting-covid-19-cures-/ ",
             "snippet_description":"Everything from echinacea and oregano oil, vitamins and other so-called natural remedies to “boost the immune system “during the threat of COVID-19,” to “ozone lamp bulbs” to ultraviolet disinfecting lamps, washable reusable dust masks, bottle sprayers and power washers billed as “COVID-19 virus prevention” able to “dispense alcohol for disinfection COVID-19 Virus Prevention. ” There were residential air purifiers listed on Kijiji with the claim “Save yourself and family from coronavirus!"
          }
       ]
    }
 ]